Белгипрозем_2017/src/Catalogs/ВидыВнутреннихДокументов/ВидыВнутреннихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыВнутреннихДокументов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДоговораЗемлеустроительныхРабот</name>
      <description>Договора землеустроительных работ</description>
    </items>
    <items>
      <name>ДокументыТехархива</name>
      <description>Документы техархива</description>
    </items>
    <items>
      <name>ДопСоглашения</name>
      <description>Дополнительные соглашения</description>
    </items>
    <items>
      <name>АктВыбора</name>
      <description>Акт выбора</description>
    </items>
    <items>
      <name>АктВыполненныхРабот</name>
      <description>Акт выполненных работ</description>
    </items>
    <items>
      <name>Дело</name>
      <description>Дело</description>
    </items>
    <items>
      <name>ДелоУслуги</name>
      <description>Дело-услуги</description>
    </items>
    <items>
      <name>Нормализация</name>
      <description>Нормализация</description>
    </items>
  </predefined>
  <attributes>
    <name>АвтоматическиВестиСоставУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоАдресатам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоКорреспондентам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоНоменклатуреДел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСтатьямДДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключенУчетПоНоменклатуреДел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьСозданиеДокументовНеПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокИсполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЭтапыОбработкиДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаПечатьШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенФайлОригинала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнениеРабочихГруппДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеУказаниеОтветственного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписыватьРезолюцииЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНедействующиеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСрокДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСуммуДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДоговором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяКомплектомДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяДопСоглашением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/ВидыВнутреннихДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей ВидаВнутреннихДокументов
//
// Возвращаемое значение:
//   Структура
//
Функция ПолучитьСтруктуруВидаВнутреннихДокументов() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Наименование");
	Параметры.Вставить("АвтоматическиВестиСоставУчастниковРабочейГруппы");
	Параметры.Вставить("ВестиУчетПоКорреспондентам");
	Параметры.Вставить("ВестиУчетПоНоменклатуреДел");
	Параметры.Вставить("ИспользоватьСрокИсполнения");
	Параметры.Вставить("ОбязателенФайлОригинала");
	Параметры.Вставить("ПодписыватьРезолюцииЭП");
	Параметры.Вставить("ОбязательноеЗаполнениеРабочихГруппДокументов");
	Параметры.Вставить("УчитыватьНедействующиеДокументы");
	Параметры.Вставить("УчитыватьСрокДействия");
	Параметры.Вставить("УчитыватьСуммуДокумента");
	Параметры.Вставить("ЯвляетсяДоговором");
	Параметры.Вставить("ЯвляетсяКомплектомДокументов");
	Параметры.Вставить("ВестиУчетПоАдресатам");
	Параметры.Вставить("Родитель");
	
	Возврат Параметры;
	
КонецФункции

// Возвращает структуру полей группы видов внутренних документов
//
// Возвращаемое значение:
//   Структура
//
Функция ПолучитьСтруктуруГруппыВидовВнутреннихДокументов() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Наименование");
	Параметры.Вставить("Комментарий");
	Параметры.Вставить("Родитель");
	
	Возврат Параметры;
	
КонецФункции

// Создает и записывает в БД вид внутреннего документа
//
// Параметры:
//   СтруктураВидаВнутреннегоДокумента - Структура - структура полей видов внутренних документов.
//
Функция СоздатьВидВнутреннегоДокумента(СтруктураВидаВнутреннегоДокумента) Экспорт
	
	НовыйВидВнутреннегоДокумента = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйВидВнутреннегоДокумента, СтруктураВидаВнутреннегоДокумента);
	НовыйВидВнутреннегоДокумента.Записать();
	
	Возврат НовыйВидВнутреннегоДокумента.Ссылка;
	
КонецФункции

// Создает и записывает в БД группу видов внутренних документа
//
// Параметры:
//   СтруктураВидаВнутреннегоДокумента - Структура - структура полей видов внутренних документов.
//
Функция СоздатьГруппуВидовВнутреннихДокументов(СтруктураГруппыВидовВнутреннихДокументов) Экспорт
	
	НоваяГруппа = СоздатьГруппу();
	ЗаполнитьЗначенияСвойств(НоваяГруппа, СтруктураГруппыВидовВнутреннихДокументов);
	НоваяГруппа.Записать();
	
	Возврат НоваяГруппа.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_УправлениеДоступом

Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат "Ссылка";
	
КонецФункции

// Заполняет переданный дескриптор доступа 
Процедура ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	ДескрипторДоступа.ВидОбъекта = ОбъектДоступа.Ссылка;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
